export default defineI18nLocale(async locale => {
  return {
    myaccount:"حسابي",
          home: "الرئيسية",
          about: "حول المؤسسة",
          adminstartors: "الهيكل الاداري",
          loginbutton: "دخول",
          counselors: "الهيئة الاستشارية",
          aboutt: "من انا",
          follow: "تابعنا",
          join:"انضم الينا",
          close:"غلق",
          articles: "المقالات",
          objective: "اهدافنا",
          objectivedesc: "نحن في الاقتصاد الشبابي نسعى لتطبيق اهدافنا مجتمعة لتكوين جيل شبابي واعي وقادر على حل المشكلات",
          login: 'دخول',
          or:"او",
          confirmEmail: 'يرجى تأكيد البريد الالكتروني الخاص بك:',
          continueWith: 'استكمال مع',
          oneClickLogin: 'دخول بضغطة واحدة',
          forgotPassword: 'نسيت كلمة المرور؟',
          signUp: 'انضم الان',
          noAccount: 'ليس لديك حساب؟',
          email: "البريد الالكتروني",
          password: "كلمة المرور",
          oneClickLoginTitle: "دخول بضغطة واحدة",
          requestLink: "لطلب رابط تسجيل الدخول من فضلك",
          enterEmail: "ادخل بريدك الالكتروني:",
          emailPlaceholder: "البريد الالكتروني",
          waiting: "انتظر ",
          sendLink: "ارسل الرابط",
          back: "عودة",
          resetPasswordTitle: "اعادة تعيين كلمة المرور",
          requestResetLink: "لطلب رابط اعادة تعيين كلمة المرور من فضلك",
          sent: "تم الارسال",
          send: "ارسال",
          signInWith: "سجل عبر",
          name: "الاسم",
          checkName: "يرجى التحقق من اسمك",
          checkEmail: "يرجى التحقق من بريدك الإلكتروني",
          phone: "رقم الهاتف",
          checkPassword: "من فضلك تحقق من كلمة المرور",
          passwordRequirements: "مثال: لا تقل عن 6 خانات ويجب ان تتضمن",
          capitalLetter: "حرف كبير",
          specialCharacter: "حرف مميز",
          number: "رقم واحد",
          minLength: "6 خانات أو أكثر",
          registerNow: "سجل الآن",
          alreadyHaveAccount: "لديك حساب بالفعل؟",
          help: "مساعدة",
          signupSuccess: "تم التسجيل بنجاح!",
          navigation: {
            Home: 'الرئيسية',
            About:  'حول المؤسسة',
            TermsOfService: 'اتفاقية الخدمة',
            ContactUs: 'تواصل معنا'
          },
          welcome: "اهلا بكم في الشباب الاقتصادي!",
  join_now_info: "انضموا الان لاكبر كيان معرفي يوفر لكم خبراء في الاقتصاد والسياسة ويساعد الجيل الناشئ على فهم الاقتصاد وادارته",
  join_now_button: "انضم الان!",
  title: "الهيكل الاداري والتنظيمي",
  members: [
    {
      name: "ياسر محمد طلعت حسن حجازي",
      major: "طالب بكليه الهندسة المدنية",
      major2:"",
      role: "رئيس كيان الشباب الاقتصادي",
    },
    {
      name: "احمد باسم",
      major: "طالب بكلية علوم الحاسب",
      major2:"",
      role: "نائب رئيس كيان الشباب الاقتصادي",
    },
    {
      name: "محمد عادل الرفاعي",
      major: "طالب بكلية الهندسة",
      major2:"",
      role: "نائب رئيس كيان الشباب الاقتصادي",
    },
    {
      name: "دكتور عبد الرحمن الطحاوي",
      major: "رئاسة مجلس الوزراء",
      major2:"جهاز حماية المستهلك",
      role: "رئيس لجنة التنمية المستدامة",
    },
    {
      name: "روان نصر",
      major: "بكالوريوس سياسة واقتصاد",
      major2:"جامعة الاسكندرية",
      role: "رئيس اللجنة الاقتصادية",
    },
    {
      name: "حسناء ابو بكر",
      major: "بكالوريوس سياسة واقتصاد",
      major2:"جامعة الاسكندرية",
      role: "نائب رئيس اللجنة الاقتصادية",
    },
    {
      name: "فتحي السيد",
      major: "بكالوريوس سياسة واقتصاد",
      major2:"جامعة الاسكندرية",
      role: "رئيس اللجنة السياسية",
    },
    {
      name: "مصطفى خلاف",
      major: "بكالوريوس سياسة واقتصاد جامعة الاسكندرية",
      major2:"جامعة الاسكندرية",
      role: "نائب رئيس اللجنة السياسية",
  },
    {
      name: "اسلام خليفة",
      major: "بكالوريوس تجارة",
      major2:"",
      role: "رئيس لجنة التنظيم",
    },
    {
      name: "م/ احمد عبدة حتاتة",
      major: "بكالوريوس الهندسة جامعة المنصورة",
      major2:"قسم حاسبات ونظم تحكم",
      role: "رئيس لجنة المتابعة",
    },
    {
      name: "محمد محمود الوكيل",
      major: "طالب بكلية حقوق جامعة المنوفية",
      major2:"",
      role: "رئيس لجنة الموارد البشرية",
    },
    {
      name: "فاطمة احمد سيد",
      major: "باحثة ماجستير طرق ومناهج التربية الرياضية",
      major2:"",
      role: "نائب رئيس لجنة الموارد البشرية",
    },
    {
      name: "دينا حاتم محمد عبد الحميد",
      major: "بكالوريوس آداب قسم جغرافيا شعبة استشعار عن بعد",
      major2:"",
      role: "رئيس لجنة العلاقات العامة",
    }
  ],
  counselorsData: [
    {
      counselorName: "ساره ابراهيم",
      profession: "محامية حره",
      bio: "أعمل بالمحاماة منذ عام 2004. أشغل حالياً منصب رئيس مجلس أمناء مؤسسة مريت نيت",
    },
    {
      counselorName: "كريم الشريف",
      profession: "يعمل باحدى شركات الاتصالات",
      bio: "في العمل العام منذ ١٣ عاما متخصص في التخطيط الاستراتيجي",
    },
    {
      counselorName: "هاني أبو الفتوح",
      profession: "٣٥ عاما من الخبره في الخدمات المصرفيه والمالية والاستشارات",
      bio: "محاضر وكاتب مستقل",
    },
    {
      counselorName: "دكتور عبد الرحمن الطحاوي",
      profession: "استشاري رئاسه مجلس الوزراء - جهاز حماية المستهلك",
      bio: "",
    }
  ],
  counselorsTitle: "الهيئه الاستشارية",
  O: [
    {
      name: "first",
      title: "اعداد قيادات شبابية مؤهلة لقيادة المؤسسات المختلفة"
    },
    {
      name: "sec",
      title: "تحقيق رؤية مصر 2030 من خلال تعزيز مشاركة الشباب في مختلف المجالات"
    },
    {
      name: "thrd",
      title: "زيادة الوعي لدي الشباب بالملف الاقتصادي وتحفيزهم على المساهمة في التنمية الاقتصادية"
    },
    {
      name: "frth",
      title: "تحقيق التكامل بين رؤى الشباب الاقتصادية ورؤية الدولة المصرية لتحقيق التنمية المستدامة"
    },
    {
      name: "fifth",
      title: "تعزيز الوعي السياسي والمشاركة الفعالة"
    },
    {
      name: "six",
      title: "تعزيز دور الشباب في الابتكار"
    },
    {
      name: "sev",
      title: "تطوير برامج ريادة الأعمال لدعم المشاريع الشبابية"
    },
    {
      name: "eght",
      title: "تعزيز الوعي البيئي لدي الشباب وتشجعيهم على المشاركة في المبادرات البيئية"
    },
    {
      name: "nin",
      title: "استخدام التكنولوجيا في الأبحاث السياسية والاقتصادية"
    },
    {
      name: "ten",
      title: "تعزيز التعاون الدولي لتبادل الخبرات والمعرفة بين الشباب المصري ونظرائهم"
    },
    {
      name: "elvn",
      title: "تفعيل دور الشباب في تحقيق استراتيجية مصر لمكافحة الفساد"
    }
  ],
  about_us: {
    title: "من نحن",
    description: "كيان شبابي إقتصادي تأسس عام 2024 تحت رعاية مؤسسة ميرت نيت المشهره برقم 12016 تابعه لوزاره التضامن الاجتماعي"
  },
  message: {
    title: "الرسالة",
    description: "نسعى إلى إعداد جيل من القيادات الشبابية المؤهلة، القادرة على قيادة المؤسسات وصنع الفارق في مختلف مجالات التنمية، لتحقيق رؤية مصر 2030. هدفنا هو بناء قادة شباب يمتلكون المهارات والخبرات اللازمة للمساهمة الفعالة في دفع عجلة التنمية الاقتصادية والاجتماعية في مصر. من خلال توفير التدريب والتأهيل اللازمين، نطمح إلى تمكين هؤلاء الشباب من تحقيق إمكانياتهم الكاملة والمساهمة في بناء مستقبل مستدام ومزدهر للبلاد."
  },
  vision: {
    title: "الرؤية",
    description: "نهدف إلى أن نكون كيانًا رائدًا ومُلهمًا على المستوى المحلي والعالمي، يُعتمد عليه كنموذج يُساهم بفعالية في تحقيق أهداف التنمية المستدامة ورؤية مصر 2030. نطمح إلى تعزيز دور الشباب في مختلف القطاعات وتحفيزهم ليكونوا شركاء أساسيين في بناء مستقبل أفضل لمصر. من خلال تبني الابتكار وتشجيع الإبداع، نعمل على تعزيز التعاون بين جميع الجهات المعنية، سواء كانت مؤسسات حكومية أو خاصة أو منظمات المجتمع المدني. نسعى إلى تزويد الشباب بالمهارات والخبرات اللازمة، وتمكينهم من تحويل رؤاهم وأفكارهم إلى مشروعات ملموسة تساهم في دفع عجلة التنمية الاقتصادية والاجتماعية."
  },
  followus:"تابعنا",
  writeComment: "اكتب تعليقاً",
  commentName: "الاسم",
  comment: "تعليق",
  rating: "تقييم",
  submit: "إرسال",
  loginPrompt: "يرجى تسجيل الدخول لإضافة تعليق",
  CommentLogin: "تسجيل الدخول",
  CommentAddedSuccessfully:"تم اضافة التعليق ",
  commentsCount: "التعليقات",
  reviewDate: "عند",
  wrote: "كتب",
  }
})